src/Documents/КВП_НачислениеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КВП_НачислениеУслуг</Name>
		</Properties>
	</Document>
</MetaDataObject>

src/InformationRegisters/УПЖКХ_СведенияДляВзаиморасчетовПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УПЖКХ_СведенияДляВзаиморасчетовПоЛС</Name>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛицевойСчет</Name>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/КВП_НачислениеУслуг/Ext/ObjectModule.bsl
// Гарант+ Килипенко 16.09.2024 [F00227727] Доработать заполнение документа начисление по приборам учета ++
#Область ОбработчикиСобытий

&После ("ОбработкаПроверкиЗаполнения")
Процедура ГП_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    // Отмена проверки реквизита Объект - т.к. ТЧ УслугиПоПоказаниямПУ заполняется из документа Ввод показаний счетчика
    Если ЭтотОбъект.ВидОперации = Перечисления.КВП_ВидыОперацийНачисленияУслуг.НачисленияПоПоказаниямПУ
        И ЭтотОбъект.УслугиПоПоказаниямПУ.Количество() > 0 Тогда
        ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ПроверяемыеРеквизиты, "Объект");
    КонецЕсли;
КонецПроцедуры

// Гарант+ Килипенко 15.10.2024 [F00229737] Формирование комментария со списком договоров ++
//
&После ("ПередЗаписью")
Процедура ГП_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    ПрефиксСпискаДоговоров = "#";

    Если Отказ
        ИЛИ (ПустаяСтрока(ЭтотОбъект.Комментарий) = Ложь И СтрНачинаетсяС(ЭтотОбъект.Комментарий, ПрефиксСпискаДоговоров) = Ложь) Тогда
        Возврат; // Если комментарий заполнен пользователем - тогда не формируем список
    КонецЕсли;

    КоллекцияСчетчиковФормирования = ЭтотОбъект.Счетчики.ВыгрузитьКолонку("Счетчик");
    СтрокаСпискаДоговоров = ГП_ПриборыУчета.СформироватьСтрокуСпискаДоговоровПоПУ(КоллекцияСчетчиковФормирования);
    Если СтрокаСпискаДоговоров = Неопределено Тогда
        Возврат; // Список не сформирован
    КонецЕсли;

    // Записываем в комментарий список договоров счетчиков
    ЭтотОбъект.Комментарий = СтрШаблон("%1 %2", ПрефиксСпискаДоговоров, СтрокаСпискаДоговоров);
КонецПроцедуры // Гарант+ Килипенко 15.10.2024 [F00229737] Формирование комментария со списком договоров --

&ИзменениеИКонтроль("ПолучитьКэшПериодовСчетчиков")
Функция ГП_ПолучитьКэшПериодовСчетчиков(ТаблицаСчетчиков)

    Запрос = Новый Запрос;
    #Вставка
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    #КонецВставки
    Запрос.Текст =
    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ТаблицаДанных.Услуга КАК Услуга,
    |	ТаблицаДанных.Счетчик КАК Счетчик,
    |	ТаблицаДанных.Объект КАК Объект,
    |	ТаблицаДанных.СписокУслуг КАК СписокУслуг,
    |	ТаблицаДанных.Здание КАК Здание,
    |	ТаблицаДанных.Помещение КАК Помещение
    |ПОМЕСТИТЬ ТаблицаСчетчиков
    |ИЗ
    |	&ТаблицаДанных КАК ТаблицаДанных
    |
    |ИНДЕКСИРОВАТЬ ПО
    |	ТаблицаДанных.Счетчик
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	ТаблицаСчетчиков.Здание КАК Здание,
    |	ТаблицаСчетчиков.Помещение КАК Помещение,
    |	ТаблицаСчетчиков.Объект КАК Объект,
    |	ТаблицаСчетчиков.Услуга КАК Услуга,
    |	ТаблицаСчетчиков.Счетчик КАК Счетчик,
    |	ТаблицаСчетчиков.СписокУслуг КАК СписокУслуг,
    |	НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ) КАК Период,
    |	ЕСТЬNULL(УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.Действует, ЛОЖЬ) КАК Действует,
    |	ВЫБОР
    |		КОГДА УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.ПриборУчета ЕСТЬ NULL
    |			ТОГДА ЛОЖЬ
    |		ИНАЧЕ ИСТИНА
    |	КОНЕЦ КАК СчетчикБылУстановлен
    |ПОМЕСТИТЬ втСостоянияПриборовУчетаВПериоде
    |ИЗ
    |	ТаблицаСчетчиков КАК ТаблицаСчетчиков
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный КАК УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный
    |		ПО ТаблицаСчетчиков.Счетчик = УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.ПриборУчета
    |			И (ВЫБОР
    |				КОГДА УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.Объект ССЫЛКА Справочник.КВП_ЛицевыеСчета
    |					ТОГДА УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.Объект = ТаблицаСчетчиков.Объект
    |				ИНАЧЕ ИСТИНА
    |			КОНЕЦ)
    |			И (УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.ДатаНачала <= &ДатаНач)
    |			И (УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.ДатаОкончания >= &ДатаНач)
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ТаблицаСчетчиков.Здание,
    |	ТаблицаСчетчиков.Помещение,
    |	ТаблицаСчетчиков.Объект,
    |	ТаблицаСчетчиков.Услуга,
    |	ТаблицаСчетчиков.Счетчик,
    |	ТаблицаСчетчиков.СписокУслуг,
    |	УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.ДатаНачала,
    |	УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.Действует,
    |	ИСТИНА
    |ИЗ
    |	ТаблицаСчетчиков КАК ТаблицаСчетчиков
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный КАК УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный
    |		ПО ТаблицаСчетчиков.Счетчик = УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.ПриборУчета
    |			И (ВЫБОР
    |				КОГДА УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.Объект ССЫЛКА Справочник.КВП_ЛицевыеСчета
    |					ТОГДА УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.Объект = ТаблицаСчетчиков.Объект
    |				ИНАЧЕ ИСТИНА
    |			КОНЕЦ)
    |			И (УПЖКХ_ИсторияСостоянийПриборовУчетаИнтервальный.ДатаНачала МЕЖДУ &ДатаНач И &ДатаКон)
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	КВП_Тарифы.Период КАК Период,
    |	КВП_Тарифы.Объект КАК Объект,
    |	КВП_Тарифы.Услуга КАК Услуга
    |ПОМЕСТИТЬ врКВП_Тарифы
    |ИЗ
    |	РегистрСведений.КВП_Тарифы КАК КВП_Тарифы
    |ГДЕ
    |	КВП_Тарифы.Организация = &Организация
    |	И КВП_Тарифы.Период МЕЖДУ &ДатаНач И &ДатаКон
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗРЕШЕННЫЕ
    |	УПЖКХ_СведенияДляВзаиморасчетовПоЛС.Период КАК Период,
    |	УПЖКХ_СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет КАК ЛицевойСчет
    |ПОМЕСТИТЬ врУПЖКХ_СведенияДляВзаиморасчетовПоЛС
    |ИЗ
    |	РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС КАК УПЖКХ_СведенияДляВзаиморасчетовПоЛС
    |ГДЕ
    |	УПЖКХ_СведенияДляВзаиморасчетовПоЛС.Период МЕЖДУ &ДатаНач И &ДатаКон
    |	И УПЖКХ_СведенияДляВзаиморасчетовПоЛС.Организация = &Организация
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	втСостоянияПриборовУчетаВПериоде.Здание КАК Здание,
    |	втСостоянияПриборовУчетаВПериоде.Помещение КАК Помещение,
    |	втСостоянияПриборовУчетаВПериоде.Объект КАК Объект,
    |	втСостоянияПриборовУчетаВПериоде.Услуга КАК Услуга,
    |	втСостоянияПриборовУчетаВПериоде.Счетчик КАК Счетчик,
    |	втСостоянияПриборовУчетаВПериоде.СписокУслуг КАК СписокУслуг,
    |	втСостоянияПриборовУчетаВПериоде.Период КАК Период,
    |	втСостоянияПриборовУчетаВПериоде.Действует КАК Действует,
    |	втСостоянияПриборовУчетаВПериоде.СчетчикБылУстановлен КАК СчетчикБылУстановлен,
    |	NULL КАК СменаТарифа,
    |	NULL КАК СменаДоговора
    |ПОМЕСТИТЬ врТаблицаИтоговыхПериодов
    |ИЗ
    |	втСостоянияПриборовУчетаВПериоде КАК втСостоянияПриборовУчетаВПериоде
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ТаблицаСчетчиков.Здание,
    |	ТаблицаСчетчиков.Помещение,
    |	ТаблицаСчетчиков.Объект,
    |	ТаблицаСчетчиков.Услуга,
    |	ТаблицаСчетчиков.Счетчик,
    |	ТаблицаСчетчиков.СписокУслуг,
    |	КВП_Тарифы.Период,
    |	NULL,
    |	NULL,
    |	ИСТИНА,
    |	NULL
    |ИЗ
    |	врКВП_Тарифы КАК КВП_Тарифы
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСчетчиков КАК ТаблицаСчетчиков
    |		ПО (ИСТИНА)
    |			И (КВП_Тарифы.Объект = НЕОПРЕДЕЛЕНО
    |				ИЛИ КВП_Тарифы.Объект = ТаблицаСчетчиков.Здание
    |				ИЛИ КВП_Тарифы.Объект = ТаблицаСчетчиков.Помещение)
    |			И (КВП_Тарифы.Услуга В (ТаблицаСчетчиков.СписокУслуг))
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |	ТаблицаСчетчиков.Здание,
    |	ТаблицаСчетчиков.Помещение,
    |	ТаблицаСчетчиков.Объект,
    |	ТаблицаСчетчиков.Услуга,
    |	ТаблицаСчетчиков.Счетчик,
    |	ТаблицаСчетчиков.СписокУслуг,
    |	УПЖКХ_СведенияДляВзаиморасчетовПоЛС.Период,
    |	NULL,
    |	NULL,
    |	NULL,
    |	ИСТИНА
    |ИЗ
    |	врУПЖКХ_СведенияДляВзаиморасчетовПоЛС КАК УПЖКХ_СведенияДляВзаиморасчетовПоЛС
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаСчетчиков КАК ТаблицаСчетчиков
    |		ПО УПЖКХ_СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет = ТаблицаСчетчиков.Объект
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ТаблицаИтоговыхПериодов.Период КАК Период,
    |	МАКСИМУМ(ТаблицаИтоговыхПериодов.Действует) КАК Действует,
    |	МАКСИМУМ(ТаблицаИтоговыхПериодов.СчетчикБылУстановлен) КАК СчетчикБылУстановлен,
    |	МАКСИМУМ(ТаблицаИтоговыхПериодов.СменаТарифа) КАК СменаТарифа,
    |	МАКСИМУМ(ТаблицаИтоговыхПериодов.СменаДоговора) КАК СменаДоговора,
    |	ТаблицаИтоговыхПериодов.Услуга КАК Услуга,
    |	ТаблицаИтоговыхПериодов.Счетчик КАК Счетчик,
    |	ТаблицаИтоговыхПериодов.Объект КАК Объект,
    |	ТаблицаИтоговыхПериодов.СписокУслуг КАК СписокУслуг,
    |	ТаблицаИтоговыхПериодов.Здание КАК Здание,
    |	ТаблицаИтоговыхПериодов.Помещение КАК Помещение
    |ИЗ
    |	врТаблицаИтоговыхПериодов КАК ТаблицаИтоговыхПериодов
    |
    |СГРУППИРОВАТЬ ПО
    |	ТаблицаИтоговыхПериодов.Период,
    |	ТаблицаИтоговыхПериодов.Услуга,
    |	ТаблицаИтоговыхПериодов.Счетчик,
    |	ТаблицаИтоговыхПериодов.Объект,
    |	ТаблицаИтоговыхПериодов.СписокУслуг,
    |	ТаблицаИтоговыхПериодов.Здание,
    |	ТаблицаИтоговыхПериодов.Помещение
    |
    |УПОРЯДОЧИТЬ ПО
    |	ТаблицаИтоговыхПериодов.Период";

    Запрос.УстановитьПараметр("ДатаНач",       НачалоМесяца(Дата));
    Запрос.УстановитьПараметр("ДатаКон",       КонецМесяца(Дата));
    Запрос.УстановитьПараметр("Организация",   Организация);
    Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаСчетчиков);

    КэшПериодовСчетчиков = Запрос.Выполнить().Выгрузить();

    КэшПериодовСчетчиков.Индексы.Добавить("Счетчик,Объект,Услуга");

    // Добавляем индексирование для дальнейшего отбора периодов объектов, в которых уже был установлен другой счетчик.
    // Это нужно для того, чтобы разделять случаи, когда счетчики на объект никогда не устанавливались и нужно начислять
    // по норме за период до его установки, и случая, когда уже был установлен другой счетчик и по новому не нужно
    // начислять по норме за период до его установки.
    КэшПериодовСчетчиков.Индексы.Добавить("Объект, Услуга, Здание, Помещение, СчетчикБылУстановлен");
    #Вставка
    Запрос.Текст = 
        "ВЫБРАТЬ
        | *
        |ИЗ втСостоянияПриборовУчетаВПериоде
        |";
    а = Запрос.Выполнить().Выгрузить();
    #КонецВставки

    Возврат КэшПериодовСчетчиков;

КонецФункции

#КонецОбласти // ОбработчикиСобытий
// Гарант+ Килипенко 16.09.2024 [F00227727] Доработать заполнение документа начисление по приборам учета --
